---
title: DGNImportOptions
classe: Autodesk.Revit.DB.DGNImportOptions
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.BaseImportOptions
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# DGNImportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String DGNModelViewName { get; set; }` | `dGNImportOptions.DGNModelViewName` | String |
| `Boolean IgnoreUnsupportedElementWarning { get; set; }` | `dGNImportOptions.IgnoreUnsupportedElementWarning` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```